### Задача 2. Расчет площади круга и длины его окружности

Описание
Напишите программу для вычисления площади круга и длины произвольной окружности по заданному радиусу. Напомним, что
площадь круга вычисляется по формуле: π x R² (константу π можно считать равной 3.14), а формула вычисления длины его
окружности: 2 x π x R.

#### Функционал программы

* Запросите пользователя ввести радиус окружности;
* Рассчитайте площадь круга, создав метод для её расчёта;
* Рассчитайте длину окружности, создав метод для её расчёта;
* Выведите на экран результат вычисления.

** Примечание: ничего страшного, если при выводе у вас после точки идёт очень много цифр.

Пример 1

* Введите радиус окружности в сантиметрах:
* 10 <enter>
* Площадь круга: 314 см.кв.
* Длина окружности: 62.8 см.

Пример 2

* Введите радиус окружности в сантиметрах:
* 4 <enter>
* Площадь круга: 50.24 см.кв.
* Длина окружности: 25.12 см.

#### Реализация

1. Добавьте в .java файл код ниже:

````
class Main {
   public static void main(String[] args) {
      System.out.println("Измените сообщение для вывода его в консоли");
   }
}
````

2. Чтобы читать сообщения из консоли, воспользуемся специальным объектом Scanner (на следующих лекциях мы подробнее
   познакомимся с термином объект). Описание Scanner (как ниже) делается только один раз на всю программу:
````
Scanner scanner = new Scanner(System.in);
````
Обязательно добавить import этого класса в самое начало файла Main.java:
```import java.util.Scanner;```

3. Чтобы прочитать введенное целое число из консоли, нужно написать:
   ```scanner.nextInt();```

4. А чтобы прочитать и сохранить введенное значение в программе для дальнейшего использования, нужно написать:
   ```int radius = scanner.nextInt();```
5. Для расчета площади круга нам понадобится константа числа Пи.

В этой программе мы воспользуемся еще одним типом данных double — это вещественный тип с плавающей запятой, он наиболее
подходит для хранения числа Пи.

6. Для объявления неизменяемого статического поля (будем использовать его внутри метода на следующих шагах) нужно в
   начале класса написать:

```public static final double PI = 3.14;```

7. Создадим метод, принимающий целое число в качестве аргумента. Назовем его ```calculateCircleArea```, он будет
   рассчитывать площадь круга и возвращать результат из метода. Так как число Пи дробное, то и рассчитанная площадь
   может получиться так же дробным числом, поэтому наш метод должен возвращать тип данных double:

````
public static double calculateCircleArea(int radius) {
   return PI * radius * radius;
}
````

8. Создадим еще один метод, принимающий целое число в качестве аргумента, назовем его ```calculateCircleLength```. Он
   будет рассчитывать длину окружности и возвращать результат из метода. Так как число Пи дробное, то и рассчитанная
   длина может получиться так же дробным числом, поэтому наш метод должно возвращать double:

````
public static double calculateCircleLength(int radius) {
   return 2 * PI * radius;
}
````

9. В методе ```public static void main``` запросим у пользователя ввести радиус окружности, который в дальнейшем
   передадим в качестве аргумента методу ```calculateCircleArea```:

````
Scanner scanner = new Scanner(System.in);
   System.out.println("Введите радиус окружности в сантиметрах:");
int radius = scanner.nextInt();
````

10. После чтения значений вызовем метод ```calculateCircleArea``` для вычисления площади:

````    
double area = ???;
````    

Далее рассчитаем длину окружности - вызовем метод ```calculateCircleLength:```

````
double length = ???;
````

11. Выведем результат на экран:

````
System.out.println("Площадь круга: " + area +  " см.кв.");
System.out.println("Длина окружности: " + length +  " см.");
````
