### Задача 1. Сумматор

Описание
Напишите программу для подсчета суммы 3-х целых чисел. Операция суммирования уже считанных чисел должна быть вынесена в
отдельный метод.

Функционал программы

* Ввод первого числа;
* Ввод второго числа;
* Ввод третьего числа;
* Вывести на экран сумму этих чисел (через вызов отдельного метода суммирования).

#### Пример

Программа расчета суммы трех чисел

* Введите первое число:
  10 `````<enter>`````
* Введите второе число:
  15 `````<enter>`````
* Введите третье число:
  20 `````<enter>`````
* Сумма чисел = 45

#### Реализация

1. Добавьте в .java файл код ниже:

````
class Main {
  public static void main(String[] args) {
    System.out.println("Сообщение для консоли");
  }
}
````

2. Чтобы читать сообщения из консоли, воспользуемся специальным объектом Scanner (на следующих лекциях мы подробнее
   познакомимся с термином объект). Описание Scanner (как ниже) делается только один раз на всю программу:

```Scanner scanner = new Scanner(System.in);```

3. Для того чтобы была возможность в коде использовать класс Scanner, нужно обязательно добавить import этого класса в
   самое начало файла

````
import java.util.Scanner;
`````

Чтобы прочитать введенное целое число из консоли, нужно написать:
```scanner.nextInt();```

А чтобы прочитать и сохранить введенное значение в программе для дальнейшего использования, нужно написать:

`````int value = scanner.nextInt();`````

4. Создадим метод, принимающий 3 целых числа в качестве аргументов. Назовем его sum, он будет складывать и возвращать
   сумму трех чисел:

````
public static int sum(???) { // Замените ??? на недостающую часть программы
return value1 + value2 + value3;
}
````

5. В методе ```public static void main``` запросим у пользователя ввести три числа, которые в дальнейшем передадим в
   качестве аргументов методу sum:

```
Scanner scanner = new Scanner(System.in);
System.out.println("Введите первое число:");
int value1 = scanner.nextInt();
// Добавьте код для чтения еще 2х значений из консоли

```

После чтения значений вызовем метод sum для вычисления суммы:

````
int result  = sum(value1, value2, value3);
````

Выведем результат на экран:

````
System.out.println("Сумма чисел = " + result);
````
